Repository: Manalang1/MobeenApplication
Catalog: MobeenApplication/*.lproj/Localizable.strings
Languages: ar

source: Always there to help you in translation
ar: دائماً هنا لمساعدتك في الترجمة

source: Express
ar: فوري

source: Specialized Translators
ar: مترجمين مختصين

source: Certified Offices
ar: مكاتب معتمدة

source: Ali Ahmed
ar: علي أحمد

source: Translator and Editor (English - Arabic) has a Bachelor’s Degree in Language and Translation
ar: مترجم ومدقق (عربي - انجليزي) لدية درجة البكالريوس في اللغات والترجمة

source: Request
ar: طلب

source: Omar Saad
ar: عمر سعد

source: Mohammed Ali
ar: محمد علي

source: Sara Abdullah
ar: سارة عبدالله

source: Noura Rashed
ar: نورة راشد

source: Torjoman
ar: ترجمان

source: Torjoman is a leading translation agency that
ar: ترجمان هي وكالة ترجمة رائدة، يعمل لدنيا اكثر من ألف مترجم محترف

source: Saleh Alomar
ar: صالح العمر

source: Saleh Alomar certifid translation aims
ar: مكتب صالح العمر للترجمة المعتمدة يهدف الى

source: Googan
ar: جوجان

source: Certified translation section fastst
ar: أفضل مكتب ترجمة معتمدة في العالم العربي

source: TransOrient
ar: عبر الشرق

source: TransOrient translation office is an ambitious establishment
ar: خدمات ترجمة يقدمها فريق من المترجمين المحترفين

source: Requests
ar: الطلبات

source: Search
ar: بحث

source: Completed
ar: مكتمل

source: Accepted
ar: تم القبول

source: Translation
ar: ترجمة

source: Massage
ar: محادثة

source: View
ar: عرض

source: Canceled
ar: تم الإلغاء

source: Pending
ar: معلق

source: Conversion
ar: تحويل النص

source: Request No. 123456
ar: رقم الطلب ١٢٣٤٥٦

source: view
ar: عرض

source: Service type:
ar: نوع الخدمة:

source: Translator
ar: المترجم

source: Date of submition:
ar: تاريخ التقديم

source: 22 Feb 2022
ar: ٢٢ فبراير ٢٠٢٢

source: Total Price:
ar: المجموع الكلي

source: 300 SAR
ar: ٣٠٠ريال

source: Payment Method
ar: طريقة الدفع

source: Apple pay
ar: آبل باي

source: Credit/Debit card
ar: بطاقة إئتمان

source: Cash
ar: الدفع عن الاستلام

source: pay
ar: الدفع

source: Text translation
ar: ترجمة نص

source: Cancel
ar: إلغاء

source: Send Request
ar: إرسال الطلب

source: Good
ar: جيد

source: Hello
ar: مرحبا

source: Mohammed
ar: محمد

source: His work is great and very accurate.
ar: عمله رائع ودقيق جداً

source: Noura Saad
ar: نورة سعد

source: Sara
ar: سارة

source: Great work.
ar: عمل جيد

source: Translator and Editor (English - Arabic) Bachelor’s Degree - Language and Translation
ar: مترجم ومحرر (إنجليزي - عربي) بكالوريوس - لغات وترجمة

source: King Saud University
ar: جامعة الملك سعود

source: Riyadh, Saudi Arabia
ar: الرياض، المملكة العربية السعودية

source: Qualifications
ar: المؤهلات

source: posted this.2w
ar: نُشر منذ اسبوعين

source: Review
ar: تقييم المستخدمين

source: Text Details
ar: تفاصيل النص

source: Date
ar: التاريخ

source: Service Type
ar: نوع الخدمة

source: Text Translation
ar: ترجمة نص

source: Text Conversion
ar: تحويل نص

source: Convert an informal text into a formal text
ar: تحويل نص من الصيغة العامة الى نص منظم ورسمي

source: Additional Notes
ar: ملاحظات إضافية
